# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]  # YOLOv8n summary: 225 layers,  3157200 parameters,  3157184 gradients,   8.9 GFLOPs
  s: [0.33, 0.50, 1024]  # YOLOv8s summary: 225 layers, 11166560 parameters, 11166544 gradients,  28.8 GFLOPs
  m: [0.67, 0.75, 768]   # YOLOv8m summary: 295 layers, 25902640 parameters, 25902624 gradients,  79.3 GFLOPs
  l: [1.00, 1.00, 512]   # YOLOv8l summary: 365 layers, 43691520 parameters, 43691504 gradients, 165.7 GFLOPs
  x: [1.00, 1.25, 512]   # YOLOv8x summary: 365 layers, 68229648 parameters, 68229632 gradients, 258.5 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 1]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 1]] # 1
  - [-1,1,space_to_depth,[1]]  # 2-P2/4 
  - [-1, 3, C2f, [128, True]]  # 3
  - [-1, 1, Conv, [256, 3, 1]] # 4
  - [-1,1,space_to_depth,[1]]  # 5-P3/8
  - [-1, 6, C2f, [256, True]]  # 6 
  - [-1, 1, Conv, [512, 3, 1]] # 7
  - [-1,1,space_to_depth,[1]]  # 8-P4/16
  - [-1, 6, C2f, [512, True]]  # 9
  - [-1, 1, Conv, [1024, 3, 1]] # 10
  - [-1,1,space_to_depth,[1]]  # 11-P6/64
  - [-1, 3, C2f, [1024, True]] # 12
  - [-1, 3, CBAMBottleneck, [1024, 3]] #13
  - [-1, 1, SPPF, [1024, 5]]  # 14

# YOLOv8.0n head
head:
  - [-1, 1, inv, [1024, 1, 1]] #15
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #16
  - [[-1, 9], 1, Concat, [1]]  # cat backbone P4 #17
  - [-1, 3, C2f, [512, False]]  # 18
  

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']] #19
  - [[-1, 6], 1, Concat, [1]]  # 20 cat backbone P3
  - [-1, 3, C2f, [256, False]]  # 21 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 1]] # 
  - [-1,1,space_to_depth,[1]]  #  -P2/4
  - [[-1, 18], 1, Concat, [1]] #  cat head P4
  - [-1, 3, C2f, [512, False]]  # 25 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 1]] # 
  - [-1,1,space_to_depth,[1]]  #
  - [[-1, 14], 1, Concat, [1]]  #  cat head P6
  - [-1, 3, C2f, [1024, False]]  # 29 (P6/64-xlarge)

  - [[21, 25, 29], 1, Detect, [nc]]  # Detect(P3, P4, P5, P6)
