# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P6 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-p6.yaml' will call yolov8-p6.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024]
  s: [0.33, 0.50, 1024]
  m: [0.67, 0.75, 768]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.25, 512]

# YOLOv8.0x6 backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 1]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 1]] # 1
  - [-1,1,space_to_depth,[1]]  # 2-P2/4 
  - [-1, 3, C2f, [128, True]]  # 3
  - [-1, 1, Conv, [256, 3, 1]] # 4
  - [-1,1,space_to_depth,[1]]  # 5-P3/8
  - [-1, 6, C2f, [256, True]]  # 6 
  - [-1, 1, Conv, [512, 3, 1]] # 7
  - [-1,1,space_to_depth,[1]]  # 8-P4/16
  - [-1, 6, C2f, [512, True]]  # 9
  - [-1, 1, Conv, [1024, 3, 1]] # 10
  - [-1,1,space_to_depth,[1]]  # 11-P6/64
  - [-1, 3, C2f, [1024, True]] # 12
  - [-1, 1, SPPF, [1024, 5]]  # 13

# YOLOv8.0x6 head
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 9], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 16

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 19 (P3/8-small)

  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 3], 1, Concat, [1]]  # cat backbone P2
  - [-1, 3, C2f, [128]]  # 22 (P2/4-xsmall)

  - [-1, 1, Conv, [128, 3, 1]]
  - [-1,1,space_to_depth,[1]]
  - [[-1, 19], 1, Concat, [1]]  # cat head P3
  - [-1, 3, C2f, [256]]  # 26 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 1]]
  - [-1,1,space_to_depth,[1]]
  - [[-1, 16], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 30 (P4/16-medium)

  - [-1, 1, Conv, [512, 3, 1]]
  - [-1,1,space_to_depth,[1]]
  - [[-1, 13], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 34 (P5/32-large)

  - [[22, 26, 30, 34], 1, Detect, [nc]]  # Detect(P2, P3, P4, P5)
